/***************************************************************************** 
Copyright 2012, AltoBeam Inc. All rights reserved.
     
File Name: AtbmCommon.c
   
Version: 1.2.2
Released 2015-03-19

Description: Example programming interface for ATBM781x

Important struct:

gstATBM781xDvbConfig
           All hardware dependent parameters should be customized according to system design          

Important functions:

ATBM781xPowerOnInit()
           This function is the first function should be called. default DVB-T/T2 8MHz Bandwidth. 
           ATBM781xSetDvbtBandwidth(unsigned char u8bandwidthMHz) function can be used to set Bandwidth for DVB-T/T2.

ATBM781xSetDVBTxMode( uint8   ui8DvbTxBandwidthType)
           This function sets the demodulator working in DVB-T/T2 auto detection mode.
	    The demodulator can receive DVB-T and DVB-T2 without discrimination on register setting.
           For example, it can be also used in mode switching between DVB-T/T2 and DVB-C
		   
           
ATBM781xSetDVBCMode()
           This function sets the demodulator working in DVB-C mode.
           For example, it can be used in mode switching between DVB-T/T2 and DVB-C

ATBM781xSetDvbSxMode() 
          This function sets the demodulator working in DVB-S/S2 mode. DVB-S/S2 auto detection.

ATBM781xTSLockFlag(uint8 *LockStatus);
           This function checks the demodulator TS locking status.   

	if(u8lockedCount >= 2)
	{
		*LockStatus = 1;		
	}
	return status;
}

/****************************************************************************
Function:    ATBM781xFECLockFlag()
Parameters: 
	LockStatus: pointer to FEC lock status
Return:      status 
Description: 
          Get FEC lock status. can be used for DVB-T/T2, DVB-C, DVBS/S2 FEC 
		  lock flag check.		
****************************************************************************/
ATBM781x_STATUS ATBM781xFECLockFlag(uint8 *LockStatus)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 u8DvbcMode = 0, u8DVBSxMode = 0;
#if ATBM781x_DVB_SS2_SUPPORT
	uint8 u8SS2Mode = 0;
	uint32 u32DvbsStatus = 0;
#endif
	uint8 u8BlockFEC = 0;
	uint32 u32DvbcStatus = 0;
	uint8  u8DVBTxMode = 0, u8TPSDone = 0, u8DvbtFecLock = 0;

	status |= ATBM781xRead(0x00, 0x13, &u8DvbcMode);
	status |= ATBM781xRead(0x00, 0x2b, &u8DVBSxMode);

	*LockStatus = 0;
	if(u8DvbcMode&0x01)
	{
		status |= ATBM781xDVBCRead(0x08, &u32DvbcStatus);       //read DVB-C internal register        
		if(u32DvbcStatus&0x20) //bit 5
		{                           
			*LockStatus = 1;	
			return status;           //DVB-C FEC locked
		}    
	}
	else if(u8DVBSxMode&0x01)
	{
#if ATBM781x_DVB_SS2_SUPPORT
		status |= ATBM781xDVBSxModeDetected(&u8SS2Mode);
		if(u8SS2Mode == ATBM781x_DVBS_MODE)
		{		 
			status |= ATBM781xDVBSRead(0x08, &u32DvbsStatus);       //read DVB-S internal register        
			if(u32DvbsStatus&0x20) //bit 5
			{                           
				*LockStatus = 1;	
				return status;           //DVB-S FEC locked
			}    
		}
		if(u8SS2Mode == ATBM781x_DVBS2_MODE)
		{	
			status |= ATBM781xRead(0x17, 0xEC, &u8BlockFEC);
			if(u8BlockFEC&0x01)
			{
				*LockStatus = 1;	
				return status;           //DVB-S2 FEC locked
			}
		}
#endif		
	}
	else
	{
		status |=  ATBM781xDVBTxModeDetected(&u8DVBTxMode);
		if((u8DVBTxMode ==ATBM781x_DVBT_MODE)&&(status== ATBM781x_SUCCESSFUL))
		{
			status |=ATBM781xRead(0x28, 0x2c, &u8TPSDone);
			status |=ATBM781xRead(0x95, 0x37, &u8DvbtFecLock);
			if((u8DvbtFecLock&0x01)&&(u8TPSDone&0x01)) /*TPS done and FEC lock, DVB-T locked*/
			{
				*LockStatus = 1;
				return status;
			}
		}
		if((u8DVBTxMode ==ATBM781x_DVBT2_MODE)&&(status== ATBM781x_SUCCESSFUL))
		{
			status |= ATBM781xRead(0x17, 0xEC, &u8BlockFEC);
			if(u8BlockFEC&0x01)
			{
				*LockStatus = 1;	
				return status;           //DVB-T2 FEC locked
			}
		}
	}
	return status;
}

/*#define  ATBM781xSUCCESS(status)   (status == ATBM781x_SUCCESSFUL)*/


void ATBM781xPrintStr(const char *StrType, const char *StrValue)
{
	ATBM781xDebugPrint ("%-20s = %s\r\n", StrType, StrValue);
}


/*
Functions: 
ATBM781xSetGPIOHighLowGPOStatus
ATBM781xSetGPIOHighLowGPO2
ATBM781xSetGPIOHighLowGPO4
ATBM781xSetGPIOHighLowGPO5
          Used to Set GPO pin High level output or low level output
gpio_pin:
The following pins may be used as GPO pin, refer to Hardware design.
ATBM781x_GPIO_PIN_TYPE GPOPinStatus;     //0x0023 bit[7:4]
ATBM781x_GPIO_PIN_TYPE GPO2PinRFAgcDvbT; //0x0021 bit[7:4] //Not used set 0
ATBM781x_GPIO_PIN_TYPE GPO4PinStatus;    //0x0037 bit[7:4]:  RegGPO7
ATBM781x_GPIO_PIN_TYPE GPO5PinStatus;    //0x0037 bit[3:0]   RegGPO6

attribute:
 1: High level
 0: Low level
*/

ATBM781x_STATUS ATBM781xSetGPIOHighLowGPOStatus(uint8 attribute)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 Reg23Value = 0;
	uint8 Reg30Value = 0;
    status |= ATBM781xRead(0x00, 0x30, &Reg30Value);
	if(attribute)
	{
		status |= ATBM781xRead(0x00, 0x23, &Reg23Value);
		if((Reg23Value&0xf0)!=0x40)
		{	
			Reg23Value&=0x0f;  /*Clear bit[7:4]*/
			Reg23Value|=0x40; /*Set bit[7:4] */
		}
		Reg30Value|=0x01;
		status |= ATBM781xWrite(0x00, 0x23, Reg23Value); 
	}else
	{
		status |= ATBM781xRead(0x00, 0x23, &Reg23Value);
		if((Reg23Value&0xf0)!=0x40)
		{	
			Reg23Value&=0x0f;  /*Clear bit[7:4]*/
			Reg23Value|=0x40; /*Set bit[7:4] */
		}
		Reg30Value&=0xfe;
		status |= ATBM781xWrite(0x00, 0x23, Reg23Value);
	}
	status |= ATBM781xWrite(0x00, 0x30, Reg30Value);
	return status;
}
ATBM781x_STATUS ATBM781xSetGPIOHighLowGPO2(uint8 attribute)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 Reg21Value = 0;
	uint8 Reg30Value = 0;
	status |=  ATBM781xRead(0x00, 0x30, &Reg30Value);
	if(attribute)
	{
		status |= ATBM781xRead(0x00, 0x21, &Reg21Value);
		if((Reg21Value&0xf0)!=0x40)
		{
			Reg21Value&=0x0f;  /*Clear bit[7:4]*/
			Reg21Value|=0x40; /*Set bit[7:4] */
		}
		Reg30Value|=0x04;
		status |=  ATBM781xWrite(0x00, 0x21, Reg21Value); 
	}else
	{

		status |= ATBM781xRead(0x00, 0x21, &Reg21Value);
		if((Reg21Value&0xf0)!=0x40)
		{
			Reg21Value&=0x0f;  /*Clear bit[7:4]*/
			Reg21Value|=0x40; /*Set bit[7:4] */
		}	
		Reg30Value&= 0xfb;
		status |= ATBM781xWrite(0x00, 0x21, Reg21Value);
	}
	status |= ATBM781xWrite(0x00, 0x30, Reg30Value);
	return status;
}
ATBM781x_STATUS ATBM781xSetGPIOHighLowGPO4(uint8 attribute)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 Reg37Value =0;
	uint8 Reg30Value = 0;
	 status |= ATBM781xRead(0x00, 0x30, &Reg30Value);
	if(attribute)
	{
		status |= ATBM781xRead(0x00, 0x37, &Reg37Value);
		if((Reg37Value&0xf0)!= 0x40)
		{		
			Reg37Value&= 0x0f;  /*Clear bit[7:4]*/
			Reg37Value|= 0x40; /*Set bit[7:4] */
		}
		Reg30Value|= 0x80;
		status |= ATBM781xWrite(0x00, 0x37, Reg37Value); 
	}else
	{
		status |= ATBM781xRead(0x00, 0x37, &Reg37Value);
		if((Reg37Value&0xf0)!= 0x40)
		{		
			Reg37Value&= 0x0f;  /*Clear bit[7:4]*/
			Reg37Value|= 0x40; /*Set bit[7:4] */
		}
		Reg30Value&= 0x7f;
		status |= ATBM781xWrite(0x00, 0x37, Reg37Value);
	}
	status |= ATBM781xWrite(0x00, 0x30, Reg30Value);
	return status;
}

ATBM781x_STATUS ATBM781xSetGPIOHighLowGPO5(uint8 attribute)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 Reg37Value =0;
	uint8 Reg30Value = 0;
	status |= ATBM781xRead(0x00, 0x30, &Reg30Value);
	if(attribute)
	{
		status |= ATBM781xRead(0x00, 0x37, &Reg37Value);
		if((Reg37Value&0x0f)!= 0x04)
		{		
			Reg37Value&= 0xf0;  /*Clear bit[3:0]*/
			Reg37Value|= 0x04; /*Set bit[3:0] */
		}
		Reg30Value|= 0x40;
		status |= ATBM781xWrite(0x00, 0x37, Reg37Value);
	}else
	{
		status |= ATBM781xRead(0x00, 0x37, &Reg37Value);
		if((Reg37Value&0x0f)!= 0x04)
		{		
			Reg37Value&= 0xf0;  /*Clear bit[3:0]*/
			Reg37Value|= 0x04; /*Set bit[3:0] */
		}		
		Reg30Value&= 0xbf;
		status |=  ATBM781xWrite(0x00, 0x37, Reg37Value);
	}
	status |= ATBM781xWrite(0x00, 0x30, Reg30Value);
	return status;
}
/*
typedef struct ATBM781x_PIN_CONFIG_STRUCT
{
ATBM781x_GPIO_PIN_TYPE GPOPinStatus;    //0x0023 bit[7:4]  
ATBM781x_GPIO_PIN_TYPE GPO1PinAgcDvbS;   //0x0021 bit[3:0] = 3
ATBM781x_GPIO_PIN_TYPE GPO2PinRFAgcDvbT; //0x0021 bit[7:4] //Not used set 0
ATBM781x_GPIO_PIN_TYPE GPO3PinAgcDvbT;   //0x0022 bit[3:0] = 1
ATBM781x_GPIO_PIN_TYPE GPO4PinStatus;   //0x0037 bit[7:4]
ATBM781x_GPIO_PIN_TYPE GPO5PinStatus;   //0x0037 bit[3:0]
}ATBM781x_PIN_CONFIG_T;
*/
/********************************************************************************
function    : ATBM781xSetGPOProperty
parameter   : 
PinName:       Pin name as ATBM781x_PIN_CONFIG_STRUCT 
uiRegAddress:  Register addr for Pin Name
HighBits:      1: Set high 4bits, 0: set low 4 bits.
state:         0: set High-Z state, 1: set as GPO state.
return      :Operate  Status:ATBM781x_SUCCESSFUL is Normal and other is abnormal.
Description:
Internal function setting GPO pins
*********************************************************************************/
ATBM781x_STATUS	ATBM781xSetGPOProperty(ATBM781x_GPIO_PIN_TYPE PinName, uint16 uiRegAddress, uint8 HighBits, uint8 state)
{
	ATBM781x_STATUS status = ATBM781x_SUCCESSFUL;
	uint8 u8RegValue = 0;
	uint8 u8BaseAddress, u8OffsetAddress;
	u8BaseAddress = (unsigned char)(uiRegAddress/256);
	u8OffsetAddress = (unsigned char)(uiRegAddress&0xff);
